app/controllers/projects_controller.rb

  def index
    @projects = Project.all
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC