app/controllers/tasks_controller.rb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = 1 AND "tasks"."id" = 3 LIMIT 1
---
  def set_task
    @task = @project.tasks.find(params[:id])